RIOT-OS/RIOT/cpu/nrf5x_common/radio/nrf802154/nrf802154_radio.c
/*
 * SPDX-FileCopyrightText: 2020 HAW Hamburg
 * SPDX-License-Identifier: LGPL-2.1-only
 */

/**
 * @ingroup     drivers_nrf5x_802154
 * @{
 *
 * @file
 * @brief       Implementation of the IEEE 802.15.4 for nRF5x radios
 *
 * @author      José I. Alamos <jose.alamos@haw-hamburg.de>
 * @}
 */

#include <assert.h>
#include <string.h>
#include <errno.h>

#include "cpu.h"
#include "nrf_clock.h"

#include "net/ieee802154.h"
#include "periph/timer.h"
#include "nrf802154.h"
#include "net/ieee802154/radio.h"

#define ENABLE_DEBUG        0
#include "debug.h"

#define ED_RSSISCALE        (4U)    /**< RSSI scale for internal HW value */
#define ED_RSSIOFFS         (-92)   /**< RSSI offset for internal HW value */

/* Set timer period to 16 us (IEEE 802.15.4 symbol time) */
#define TIMER_FREQ          (62500UL)

#ifdef CPU_FAM_NRF54L
/* Compatibility wrapper for the nRF54L family: the radio peripheral has two
 * interrupt lines (the application core uses line 0), the MODECNF0 register
 * was renamed to TIMING, MHRMATCHMAS to MHRMATCHMASK and the POWER register
 * was removed */
#define RADIO_IRQn                      RADIO_0_IRQn
#define isr_radio                       isr_radio_0
#define INTENSET                        INTENSET00
#define MODECNF0                        TIMING
#define MHRMATCHMAS                     MHRMATCHMASK
#define RADIO_MODECNF0_RU_Msk           RADIO_TIMING_RU_Msk
#define RADIO_INTENSET_END_Msk          RADIO_INTENSET00_END_Msk
#define RADIO_INTENSET_FRAMESTART_Msk   RADIO_INTENSET00_FRAMESTART_Msk
#define RADIO_INTENSET_CCAIDLE_Msk      RADIO_INTENSET00_CCAIDLE_Msk
#define RADIO_INTENSET_CCABUSY_Msk      RADIO_INTENSET00_CCABUSY_Msk
#endif

#define TX_POWER_MIN        (-40)                               /* in dBm */
#ifdef CPU_FAM_NRF54L
#define TX_POWER_MAX        (8)                                 /* in dBm */
#else
#define TX_POWER_MAX        ((int)RADIO_TXPOWER_TXPOWER_Max)    /* in dBm */
#endif

/**
 * @brief Default nrf802154 radio shortcuts
 *
 * With this configuration the radio goes on the RXREADY event to RXSTART
 * and on TXREADY to TXSTART, without requiring to trigger the task manually.
 */
#define DEFAULT_SHORTS      (RADIO_SHORTS_RXREADY_START_Msk | \
                             RADIO_SHORTS_TXREADY_START_Msk)

/**
 * @brief nrf52840 shortcuts for CCA on send
 *
 * With this configuration the radio automatically triggers a CCA request on
 * RXREADY event. If the CCA succeeds, the radio will automatically send the
 * frame. Otherwise it will simply go to DISABLE.
 */
#define CCA_SHORTS          (RADIO_SHORTS_RXREADY_CCASTART_Msk | \
                             RADIO_SHORTS_CCAIDLE_STOP_Msk | \
                             RADIO_SHORTS_CCAIDLE_TXEN_Msk | \
                             RADIO_SHORTS_CCABUSY_DISABLE_Msk | \
                             RADIO_SHORTS_TXREADY_START_Msk)

#define MAC_TIMER_CHAN_IFS  (1U)    /**< MAC timer channel for handling IFS logic */

static uint8_t rxbuf[IEEE802154_FRAME_LEN_MAX + 3]; /* len PHR + PSDU + LQI */
static uint8_t txbuf[IEEE802154_FRAME_LEN_MAX + 3]; /* len PHR + PSDU + LQI */

typedef enum {
    STATE_IDLE,
    STATE_TX,
    STATE_RX,
    STATE_CCA_CLEAR,
    STATE_CCA_BUSY,
} nrf802154_state_t;

static volatile uint8_t _state;

static uint8_t nrf802154_short_addr[IEEE802154_SHORT_ADDRESS_LEN];
static uint8_t nrf802154_long_addr[IEEE802154_LONG_ADDRESS_LEN];
static uint16_t nrf802154_pan_id;

static struct {
    bool ifs        : 1;    /**< if true, the device is currently inside the IFS period */
    bool cca_send   : 1;    /**< whether the next transmission uses CCA or not */
    bool ack_filter : 1;    /**< whether the ACK filter is activated or not */
    bool promisc    : 1;    /**< whether the device is in promiscuous mode or not */
    bool pending    : 1;    /**< whether there pending bit should be set in the ACK frame or not */
} cfg = {
    .cca_send   = true,
    .ack_filter = true,
};

static const ieee802154_radio_ops_t nrf802154_ops;
static ieee802154_dev_t *nrf802154_hal_dev;

#ifdef CPU_FAM_NRF54L
/* the nRF54L radio has no POWER register, so only the HFXO requests are
 * tracked here */
static bool _powered;

static void _power_on(void)
{
    if (!_powered) {
        clock_hfxo_request();
        _powered = true;
    }
}

static void _power_off(void)
{
    if (_powered) {
        _powered = false;
        clock_hfxo_release();
    }
}
#else
static void _power_on(void)
{
    if (NRF_RADIO->POWER == 0) {
        clock_hfxo_request();
        NRF_RADIO->POWER = 1;
    }
}

static void _power_off(void)
{
    if (NRF_RADIO->POWER == 1) {
        NRF_RADIO->POWER = 0;
        clock_hfxo_release();
    }
}
#endif

static bool _l2filter(uint8_t *mhr)
{
    uint8_t dst_addr[IEEE802154_LONG_ADDRESS_LEN];
    uint8_t src_addr[IEEE802154_LONG_ADDRESS_LEN];
    le_uint16_t dst_pan;
    le_uint16_t src_pan;
    uint8_t pan_bcast[] = IEEE802154_PANID_BCAST;

    int dst_addr_len = ieee802154_get_dst(mhr, dst_addr, &dst_pan);

    int src_addr_len = ieee802154_get_src(mhr, src_addr, &src_pan);

    if ((mhr[0] & IEEE802154_FCF_TYPE_MASK) == IEEE802154_FCF_TYPE_BEACON) {
        if (src_addr_len == IEEE802154_SHORT_ADDRESS_LEN ||
            src_addr_len == IEEE802154_LONG_ADDRESS_LEN){
            if ((memcmp(&nrf802154_pan_id, src_pan.u8, 2) == 0) ||
                (memcmp(&nrf802154_pan_id, pan_bcast, 2) == 0)) {
                return true;
            }
        }
    }
    /* filter PAN ID */
    /* Will only work on little endian platform (all?) */

    if ((memcmp(pan_bcast, dst_pan.u8, 2) != 0) &&
        (memcmp(&nrf802154_pan_id, dst_pan.u8, 2) != 0)) {
        return false;
    }

    /* check destination address */
    if (((dst_addr_len == IEEE802154_SHORT_ADDRESS_LEN) &&
          (memcmp(nrf802154_short_addr, dst_addr, dst_addr_len) == 0 ||
           memcmp(ieee802154_addr_bcast, dst_addr, dst_addr_len) == 0)) ||
        ((dst_addr_len == IEEE802154_LONG_ADDRESS_LEN) &&
          (memcmp(nrf802154_long_addr, dst_addr, dst_addr_len) == 0))) {
        return true;
    }

