RIOT-OS/RIOT/cpu/nrf5x_common/radio/nrf802154/nrf802154_radio.c
    return false;
}

static int _write(ieee802154_dev_t *dev, const iolist_t *iolist)
{
    (void)dev;

    DEBUG("[nrf802154] Send a packet\n");

    assert(iolist);

    /* copy packet data into the transmit buffer */
    unsigned int len = 0;

    /* Load packet data into FIFO. Size checks are handled by higher
     * layers */
    for (; iolist; iolist = iolist->iol_next) {
        /* Check if there is data to copy, prevents undefined behaviour with
         * memcpy when iolist->iol_base == NULL */
        if (iolist->iol_len) {
            memcpy(&txbuf[len + 1], iolist->iol_base, iolist->iol_len);
            len += iolist->iol_len;
        }
    }

    DEBUG("[nrf802154] send: putting %i bytes into the frame buffer\n", len);

    /* specify the length of the package. */
    txbuf[0] = len + IEEE802154_FCS_LEN;

    return 0;
}

static void _disable(void)
{
    /* set device into DISABLED state */
    if (NRF_RADIO->STATE != RADIO_STATE_STATE_Disabled) {
        NRF_RADIO->EVENTS_DISABLED = 0;
        NRF_RADIO->TASKS_DISABLE = 1;
        DEBUG("[nrf802154] Device state: DISABLED\n");
    }
}

static void _disable_blocking(void)
{
    _disable();

    /* This will take in worst case 21 us */
    while (NRF_RADIO->STATE != RADIO_STATE_STATE_Disabled) {};
}

static int _request_op(ieee802154_dev_t *dev, ieee802154_hal_op_t op, void *ctx)
{
    (void)dev;

    int res = -EBUSY;
    int state = STATE_IDLE;

    switch (op) {
    case IEEE802154_HAL_OP_TRANSMIT:
        if (cfg.ifs) {
            goto end;
        }
        NRF_RADIO->SHORTS = cfg.cca_send ? CCA_SHORTS : DEFAULT_SHORTS;
        NRF_RADIO->TASKS_TXEN = 1;
        state = STATE_TX;
        break;
    case IEEE802154_HAL_OP_SET_RX:
        if (_state != STATE_IDLE && _state != STATE_RX) {
            goto end;
        }
        _disable_blocking();
        state = STATE_RX;
        NRF_RADIO->PACKETPTR = (uint32_t) rxbuf;
        NRF_RADIO->SHORTS = DEFAULT_SHORTS;
        NRF_RADIO->TASKS_RXEN = 1;
        break;
    case IEEE802154_HAL_OP_SET_IDLE: {
        assert(ctx);
        bool force = *((bool*) ctx);
        if (!force && _state != STATE_IDLE && _state != STATE_RX) {
            goto end;
        }
        _disable_blocking();
        NRF_RADIO->SHORTS = DEFAULT_SHORTS;
        NRF_RADIO->PACKETPTR = (uint32_t) txbuf;
        state = STATE_IDLE;
        break;
    }
    case IEEE802154_HAL_OP_CCA:
        _disable_blocking();
        NRF_RADIO->SHORTS = RADIO_SHORTS_RXREADY_CCASTART_Msk;
        NRF_RADIO->TASKS_RXEN = 1;
        state = STATE_IDLE;
        break;
    default:
        assert(false);
        state = 0;
        break;
    }

    _state = state;
    res = 0;

end:
    return res;
}

static int _confirm_op(ieee802154_dev_t *dev, ieee802154_hal_op_t op, void *ctx)
{
    (void)dev;
    bool eagain;
    ieee802154_tx_info_t *info = ctx;
    int state = _state;
    bool enable_shorts = false;
    int radio_state = NRF_RADIO->STATE;
    switch (op) {
    case IEEE802154_HAL_OP_TRANSMIT:
        info = ctx;
        eagain = (state != STATE_IDLE
            && state != STATE_CCA_BUSY && NRF_RADIO->STATE != RADIO_STATE_STATE_Disabled);

        state = STATE_IDLE;
        enable_shorts = true;
        if (info) {
            info->status = (_state == STATE_CCA_BUSY) ? TX_STATUS_MEDIUM_BUSY : TX_STATUS_SUCCESS;
        }

        break;
    case IEEE802154_HAL_OP_SET_RX:
        eagain = (radio_state == RADIO_STATE_STATE_RxRu);
        break;
    case IEEE802154_HAL_OP_SET_IDLE:
        eagain = (radio_state == RADIO_STATE_STATE_TxDisable ||
                  radio_state == RADIO_STATE_STATE_RxDisable);
        break;
    case IEEE802154_HAL_OP_CCA:
        eagain = (state != STATE_CCA_BUSY && state != STATE_CCA_CLEAR);
        assert(ctx);
        *((bool*) ctx) = (state == STATE_CCA_CLEAR) ? true : false;
        state = STATE_IDLE;
        break;
    default:
        eagain = false;
        assert(false);
        break;
    }

    if (eagain) {
        return -EAGAIN;
    }

    _state = state;

    if (enable_shorts) {
        NRF_RADIO->SHORTS = DEFAULT_SHORTS;
        DEBUG("[nrf802154] TX Finished\n");
    }
    return 0;
}

static int _read(ieee802154_dev_t *dev, void *buf, size_t max_size,
                          ieee802154_rx_info_t *info)
{
    (void)dev;
    size_t pktlen = (size_t)rxbuf[0] - IEEE802154_FCS_LEN;
    int res = -ENOBUFS;

    if (max_size < pktlen) {
        DEBUG("[nrf802154] recv: buffer is to small\n");
        return res;
    }

    DEBUG("[nrf802154] recv: reading packet of length %i\n", pktlen);
    if (info != NULL) {
        ieee802154_rx_info_t *radio_info = info;
        /* Hardware link quality indicator */
        uint8_t hwlqi = rxbuf[pktlen + 1];
        /* Convert to 802.15.4 LQI (page 319 of product spec v1.1) */
        radio_info->lqi = (uint8_t)(hwlqi > UINT8_MAX/ED_RSSISCALE
                                   ? UINT8_MAX
                                   : hwlqi * ED_RSSISCALE);
        /* Converting the hardware-provided LQI value back to the
           original RSSI value is not properly documented in the PS.
           The linear mapping used here has been found empirically
           through comparison with the RSSI value provided by NRF_RADIO->RSSISAMPLE
           after enabling the ADDRESS_RSSISTART short. */
        int16_t rssi_dbm = hwlqi + ED_RSSIOFFS - 1;
        radio_info->rssi = ieee802154_dbm_to_rssi(rssi_dbm);
    }
    memcpy(buf, &rxbuf[1], pktlen);

    return pktlen;
}

/**
 * @brief   Convert from dBm to the internal representation, when the
 *          radio operates as a IEEE802.15.4 transceiver.
 */
static inline uint8_t _dbm_to_ieee802154_hwval(int8_t dbm)
{
    return ((dbm - ED_RSSIOFFS) / ED_RSSISCALE);
}

static int set_cca_threshold(ieee802154_dev_t *dev, int8_t threshold)
{
    (void)dev;

    if (threshold < ED_RSSIOFFS) {
        return -EINVAL;
    }

    uint8_t hw_val = _dbm_to_ieee802154_hwval(threshold);

    NRF_RADIO->CCACTRL &= ~RADIO_CCACTRL_CCAEDTHRES_Msk;
    NRF_RADIO->CCACTRL |= hw_val << RADIO_CCACTRL_CCAEDTHRES_Pos;
    return 0;
}

#ifdef CPU_FAM_NRF54L
/* on the nRF54L the TXPOWER register holds an encoded value instead of the
 * raw dBm value, so the closest supported level is looked up */
static void _set_txpower(int16_t txpower)
{
    static const struct {
        int16_t dbm;
        uint32_t val;
    } _txpower_lut[] = {
        { 8, RADIO_TXPOWER_TXPOWER_Pos8dBm },
        { 7, RADIO_TXPOWER_TXPOWER_Pos7dBm },
        { 6, RADIO_TXPOWER_TXPOWER_Pos6dBm },
        { 5, RADIO_TXPOWER_TXPOWER_Pos5dBm },
        { 4, RADIO_TXPOWER_TXPOWER_Pos4dBm },
        { 3, RADIO_TXPOWER_TXPOWER_Pos3dBm },
        { 2, RADIO_TXPOWER_TXPOWER_Pos2dBm },
        { 1, RADIO_TXPOWER_TXPOWER_Pos1dBm },
        { 0, RADIO_TXPOWER_TXPOWER_0dBm },
        { -4, RADIO_TXPOWER_TXPOWER_Neg4dBm },
        { -8, RADIO_TXPOWER_TXPOWER_Neg8dBm },
        { -12, RADIO_TXPOWER_TXPOWER_Neg12dBm },
        { -16, RADIO_TXPOWER_TXPOWER_Neg16dBm },
        { -20, RADIO_TXPOWER_TXPOWER_Neg20dBm },
        { -40, RADIO_TXPOWER_TXPOWER_Neg40dBm },
    };

